<?php

use yii\db\Migration;

/**
 * Class m250326_082020_insert_data
 */
class m250326_082020_insert_data extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        // Вставка данных в таблицу `organisations`
        $this->batchInsert('organisations', ['id', 'full_name'], [
            [1, 'Организатор 1'],
            [2, 'Организатор 2'],
            [3, 'Организатор 3'],
            [4, 'Организатор 4'],
            [5, 'Организатор 5'],
            [6, 'Организатор 6'],
            [8, 'Организатор 7'],
            [9, 'Организатор 8'],
        ]);

        // Вставка данных в таблицу `prizewinner`
        $this->batchInsert('prizewinner', ['id', 'prize_place', 'reward'], [
            [1, 1, 'Золотая медаль'],
            [2, 2, 'Серебряная медаль'],
            [3, 3, 'Бронзовая медаль'],
        ]);

        // Вставка данных в таблицу `kind_of_sport`
        $this->batchInsert('kind_of_sport', ['id', 'name'], [
            [1, 'Баскетбол'],
            [2, 'Футбол'],
            [3, 'Волейбол'],
            [4, 'Баскетбол ногой'],
            [6, 'Квидич'],
        ]);

        // Вставка данных в таблицу `structure`
        $this->batchInsert('structure', ['id', 'name', 'type'], [
            [1, 'Спартак', 'Стадион'],
            [2, 'Динамо', 'Стадион'],
            [3, 'Сельмаш', 'Стадион'],
            [4, 'Номер 1', 'Корт'],
            [5, 'Номер 2', 'Корт'],
            [6, 'Фитрон', 'Спортивный зал'],
            [7, 'WGym', 'Спортивный зал'],
            [8, 'Подвальная качалка', 'Спортивный зал'],
            [9, 'Манеж ДГТУ', 'Манеж'],
            [11, 'test', 'Стадион'],
        ]);

        // Вставка данных в таблицу `sports_club`
        $this->batchInsert('sports_club', ['id', 'name'], [
            [1, 'Кайдзё'],
            [2, 'Тоо'],
            [3, 'Ракузан'],
            [4, 'Щютоку'],
            [5, 'Сейрин'],
            [6, 'Йосен'],
        ]);

        // Вставка данных в таблицу `trainers`
        $this->batchInsert('trainers', ['id', 'name', 'id_kind_of_sport'], [
            [1, 'Коби Брайант', 1],
            [2, 'Леонель Месси', 2],
            [3, 'Лоренцо Бернарди', 3],
            [4, 'Леброн Джеймс', 1],
            [5, 'Кайри Ирвинг', 1],
            [6, 'Виктор Вембаньяма', 1],
            [7, 'Криштиану Роналду', 2],
            [8, 'Неймар Да Силва Сантос Жуниор', 2],
            [10, 'test', 4],
        ]);

        // Вставка данных в таблицу `sportsman`
        $this->batchInsert('sportsman', ['id', 'name', 'discharge', 'id_sports_club'], [
            [1, 'Кисе', 3, 1],
            [2, 'Аомине', 3, 2],
            [3, 'Акаши', 3, 3],
            [4, 'Небуя', 2, 3],
            [5, 'Касаматсу', 2, 1],
            [6, 'Мидорима', 3, 4],
            [7, 'Куроко', 3, 5],
            [8, 'Кагами', 3, 5],
            [9, 'Мурасакибара', 3, 6],
            [10, 'Татсуя', 2, 6],
            [11, 'Такао', 2, 4],
            [12, 'Имаеши', 2, 2],
            [13, 'Miroslaw', 1, 5],
        ]);

        // Вставка данных в таблицу `competitions`
        $this->batchInsert('competitions', ['id', 'name', 'id_structure', 'id_kind_of_sport', 'event_date'], [
            [1, 'Зимний кубок', 1, 1, '2021-09-20'],
            [2, 'Весенний кубок', 5, 3, '2021-09-21'],
            [3, 'Летний кубок', 3, 2, '2020-05-20'],
            [4, 'Баскетбольный турнир 1', 9, 1, '2020-03-01'],
            [5, 'Футбольный чемпионат 1', 2, 2, '2020-07-01'],
            [6, 'Волейбольный кубок 1', 4, 3, '2020-08-15'],
            [7, 'Баскетбольный турнир 11 norm', 4, 2, '2024-11-12'],
            [8, 'lorem123ipsum', 3, 1, '2020-01-25'],
            [9, 'Норм название и дата', 5, 3, '2022-05-25'],
            [10, 'final proverka1337', 9, 3, '2024-11-13'],
            [11, 'super final proverka', 5, 3, '2024-11-14'],
            [12, 'future кубок', 3, 1, '2024-12-11'],
            [13, 'Декабрьское соревнование N1', 9, 3, '2024-12-15'],
            [14, 'Бесконечность не предел', 2, 4, '9999-09-09'],
            [15, 'Соревнования по квидичу', 4, 6, '2025-07-31'],
        ]);

        // Вставка данных в таблицу `organisations_competitions`
        $this->batchInsert('organisations_competitions', ['id', 'id_organisations', 'id_competitions'], [
            [1, 1, 1],
            [2, 1, 2],
            [3, 3, 3],
            [4, 4, 4],
            [5, 5, 5],
            [6, 6, 6],
            [7, 1, 7],
            [8, 6, 8],
            [9, 4, 9],
            [10, 5, 10],
            [11, 6, 11],
        ]);

        // Вставка данных в таблицу `sportsman_competitions`
        $this->batchInsert('sportsman_competitions', ['id', 'id_sportsman', 'id_competitions'], [
            [1, 1, 1],
            [2, 4, 1],
            [3, 5, 1],
            [4, 9, 2],
            [5, 3, 2],
            [6, 8, 2],
            [7, 13, 3],
            [8, 11, 3],
            [9, 12, 3],
            [10, 6, 4],
            [11, 3, 4],
            [12, 4, 4],
            [13, 4, 4],
            [14, 5, 5],
            [15, 1, 5],
            [16, 2, 5],
            [17, 8, 6],
            [18, 3, 6],
        ]);

        // Вставка данных в таблицу `sportsman_trainers`
        $this->batchInsert('sportsman_trainers', ['id', 'id_sportsman', 'id_trainers'], [
            [1, 8, 1],
            [2, 9, 1],
            [3, 10, 1],
            [4, 8, 2],
            [5, 11, 3],
            [6, 11, 6],
            [7, 13, 5],
            [8, 1, 4],
            [9, 2, 5],
            [10, 3, 1],
            [11, 4, 6],
            [12, 5, 2],
            [13, 6, 6],
            [14, 7, 5],
            [15, 8, 5],
            [16, 9, 4],
            [17, 11, 5],
        ]);

        // Вставка данных в таблицу `sportsman_kind_of_sport`
        $this->batchInsert('sportsman_kind_of_sport', ['id', 'id_sportsman', 'id_kind_of_sport'], [
            [1, 1, 1],
            [2, 2, 1],
            [3, 3, 1],
        ]);

        // Вставка данных в таблицу `sportsman_prizewinner`
        $this->batchInsert('sportsman_prizewinner', ['id', 'id_competition', 'id_sportsman', 'id_prizewinner'], [
            [1, 2, 1, 1],
            [2, 2, 2, 2],
            [3, 2, 3, 3],
            [4, 3, 1, 1],
            [5, 3, 2, 2],
            [6, 3, 3, 3],
            [7, 4, 1, 1],
            [8, 4, 2, 2],
            [9, 4, 3, 3],
            [10, 5, 1, 1],
            [11, 5, 2, 2],
            [12, 5, 3, 3],
            [13, 6, 1, 1],
            [14, 6, 2, 2],
            [15, 6, 3, 3],
            [16, 7, 1, 1],
            [17, 7, 2, 2],
            [18, 7, 3, 3],
            [19, 8, 1, 1],
            [20, 8, 2, 2],
            [21, 8, 3, 3],
            [22, 9, 1, 1],
            [23, 9, 2, 2],
            [24, 9, 3, 3],
            [25, 10, 1, 1],
            [26, 10, 2, 2],
            [27, 10, 3, 3],
            [28, 11, 1, 1],
            [29, 11, 2, 2],
            [30, 11, 3, 3],
            [31, 13, 1, 1],
            [32, 13, 2, 2],
            [33, 13, 3, 3],
        ]);

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m250326_082020_insert_data cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m250326_082020_insert_data cannot be reverted.\n";

        return false;
    }
    */
}
